package 基础练习.b2_01字串;

/**
 * Description:硬解
 *      对于长度为5位的一个01串，每一位都可能是0或1，一共有32种可能。它们的前几个是：
 *      00000
 *      00001
 *      00010
 *      00011
 *      00100
 *      请按从小到大的顺序输出这32种01串。
 * User: zhenghb03
 * Date: 2018-03-16
 */
public class Main1 {
    public static void main(String[] args) {
        System.out.println("00000\n" +
                "00001\n" +
                "00010\n" +
                "00011\n" +
                "00100\n" +
                "00101\n" +
                "00110\n" +
                "00111\n" +
                "01000\n" +
                "01001\n" +
                "01010\n" +
                "01011\n" +
                "01100\n" +
                "01101\n" +
                "01110\n" +
                "01111\n" +
                "10000\n" +
                "10001\n" +
                "10010\n" +
                "10011\n" +
                "10100\n" +
                "10101\n" +
                "10110\n" +
                "10111\n" +
                "11000\n" +
                "11001\n" +
                "11010\n" +
                "11011\n" +
                "11100\n" +
                "11101\n" +
                "11110\n" +
                "11111");
    }
}
